[
  {
    "role": "Senior Full Stack Software Engineer (Contract)",
    "organization": "My Editor Inc",
    "startDate": "May, 2024",
    "endDate": "Present",
    "experiences": [
      "Pitched and led the full development of in-house web-based tooling and data storage systems, ensuring alignment with business goals and user needs.",
      "Designed and architected a React-based web tool that boosted productivity by 37%, streamlining workflows and enhancing user experience.",
      "Built a scalable MongoDB back-end that reduced productivity downtime by 24%, ensuring robust performance and data integrity.",
      "Implemented coding best practices and unit testing, significantly reducing technical debt and improving future development turnaround times.",
      "Managed a team of 2 developers, fostering collaboration, meeting project deadlines, and driving successful project delivery."
    ],
    "imageSrc": "history/myeditor.png"
  },
  {
    "role": "Tooling Architect / Lead Engineer - Full Stack Software Engineer 2",
    "organization": "Zynga",
    "startDate": "Jan, 2020",
    "endDate": "Jan, 2024",
    "experiences": [
      "Owned, maintained, and innovated a suite of digital tooling products supporting an app with millions of daily active users. Reduced tool development timelines by 428%, turning 3-month projects into 3-week ones.",
      "Architected tools that improved productivity across multiple departments, increasing content integration efficiency by 144% and reducing user errors by 86%.",
      "Engineered content integration tools using React, Mobx, React-Native, ExpressJS, JavaScript/TypeScript, React-Bootstrap, Webpack, SCSS/CSS. Ensured high-quality code with unit testing solutions like Jest, ESLint, RSpec, and Cucumber.",
      "Built backend solutions using Ruby on Rails, Redis, and AWS, adding user-retention features and actionable metrics to a flagship product.",
      "Maintained and reviewed large-scale repositories through GitHub Enterprise, improving workflows with tools like NVM, NPM, Gulp, Docker, and NodeJS.",
      "Designed and implemented microservice architecture, breaking down large monolithic applications into modular, independently deployable services. This approach improved scalability, reduced downtime, and streamlined the integration of new features. Worked closely with cross-functional teams to ensure smooth communication between microservices using RESTful APIs.",
      "Maintained and reviewed large-scale monorepo for the frontend tooling suite while also participating in a polyrepo of backend repositories through GitHub Enterprise, improving workflows with tools like NVM, NPM, Gulp, Docker, and NodeJS.",
      "Proto-typing integrated AI-driven content automation tools.",
      "Coordinated initiatives across various leadership levels, from onboarding co-op engineers to working with directors, project managers, and non-technical stakeholders.",
      "Enforced best practices and peer review processes, reducing tech debt and improving code quality by 162%. Mentored team members to elevate their skills and deliver higher-quality results.",
      "Managed and led a team of 3 developers, ensuring project timelines were met and fostering a collaborative, high-performance environment."
    ],
    "imageSrc": "history/T2_Zynga.png"
  },
  {
    "role": "Lead Client Side Software / Mobile Engineer - Full Stack Developer",
    "organization": "Parlay Games Inc",
    "startDate": "Jun, 2011",
    "endDate": "Jan, 2020",
    "experiences": [
      "Designed, maintained, and enhanced client-side social and gaming applications to ensure a seamless user experience.",
      "Upgraded AS2/AS3 products to modern standards, converting them to HTML5, SCSS, JavaScript, and Node.js, improving performance and compatibility.",
      "Utilized libraries such as Phaser, Vagrant, GSAP, Express, Pixi, Backbone, NPM, and REST API to build robust solutions.",
      "Applied WCAG and AODA accessibility standards to ensure all applications were accessible to users with disabilities, focusing on visual, auditory, and navigational needs.",
      "Engineered applications for Windows, iOS, and Android to expand accessibility and user reach.",
      "Managed and mentored a team of six developers, fostering collaboration and meeting project deadlines while exploring emerging technologies like Unity and Construct 2/3.",
      "Oversaw project timelines, delegated tasks, and ensured successful delivery of high-quality solutions."
    ],
    "imageSrc": "history/Parlay.png"
  },
  {
    "role": "Flex Developer",
    "organization": "LetoSoft Corporation",
    "startDate": "Dec, 2010",
    "endDate": "May, 2011",
    "experiences": [
      "Created high-performing social and gaming application user interfaces to increase user engagement.",
      "Dynamic and responsively designed interface elements to enhance the overall performance of the program.",
      "Worked together to guarantee that functionality and user experience were seamlessly integrated with designers and stakeholders.",
      "To guarantee seamless interactions and rapid load times, performance testing and optimization were carried out.",
      "Maintained readability and quality of code by putting best practices for UI development into practice."
    ],
    "imageSrc": "history/LetoSoft.png"
  },
  {
    "role": "Flash / Flex Developer",
    "organization": "Hitgrab Inc",
    "startDate": "Aug, 2010",
    "endDate": "Oct, 2010",
    "experiences": [
      "Created social concept gaming user interfaces to increase player involvement.",
      "Responsive game elements that are engineered for better usability and performance.",
      "Worked in tandem with designers to match user experience and game mechanics.",
      "Interfaces that have been optimized for fast load times and seamless operation.",
      "Best practices were used to guarantee scalable and maintainable programming."
    ],
    "imageSrc": "history/HitGrab.png"
  },
  {
    "role": "Senior Flex Developer (Contract)",
    "organization": "Outside The Cubicle",
    "startDate": "May, 2009",
    "endDate": "Nov, 2009",
    "experiences": [
      "Improved user accessibility by adding language support to a touch screen food intake application for Pizza Pizza.",
      "Created a software for Tier 1 support technicians that provides streaming video assistance.",
      "Worked in tandem with groups to smoothly include multilingual features.",
      "Carried out usability testing to improve the touch screen user interface.",
      "Used best practices to preserve the performance and quality of the code."
    ],
    "imageSrc": "history/OutsideTheCubicle.png"
  },
  {
    "role": "Project Manager, Flash Developer / Animator",
    "organization": "Buzz Interactive",
    "startDate": "Jan, 2008",
    "endDate": "May, 2009",
    "experiences": [
      "Oversaw four team members, several projects and clients to ensure timely delivery.",
      "Developed and delivered proposals to win over new client business.",
      "Developed creative Flash UI ideas to improve user interaction.",
      "For best results, a digital signage system was upgraded and maintained for TD Bank.",
      "Simple games were created to increase user engagement and enjoyment."
    ],
    "imageSrc": "history/BuzzInteractive.png"
  }
]
